[
  {
    "title": "Fog Computing Architecture for Load Balancing in Parallel Production with a Distributed MES",
    "abstract": "The technological growth in the automation of manufacturing processes, as seen in Industry 4.0, is characterized by a constant revolution and evolution in small- and medium-sized factories. As basic and advanced technologies from the pillars of Industry 4.0 are gradually incorporated into their value chain, these factories can achieve adaptive technological transformation. This article presents a practical solution for companies seeking to evolve their production processes during the expansion phase of their manufacturing, starting from a base architecture with Industry 4.0 features which then integrate and implement specific tools that facilitate the duplication of installed capacity; this creates a situation that allows for the development of manufacturing execution systems (MESs) for each production line and a fog computing node, which is responsible for optimizing the load balance of order requests coming from the cloud and also acts as an intermediary between MESs and the cloud. On the other hand, legacy Machine Learning (ML) inference acceleration modules were integrated into the single-board computers of MESs to improve workflow across the new architecture. These improvements and integrations enabled the value chain of this expanded architecture to have lower latency, greater scalability, optimized resource utilization, and improved resistance to network service failures compared to the initial one.",
    "link": "https://www.mdpi.com/",
    "pdf": "https://www.mdpi.com/2076-3417/15/13/7438/pdf?version=1751536500",
    "published": "2025-10-27"
  },
  {
    "title": "",
    "abstract": "Enterprise today heavily invests in big data, data warehouses, and green computing to measure performance and make intelligent decisions. By enabling data warehouse architecture, enterprises can store structural and nonstructural data in defined backend systems and transform amounts of data to perform various analyses and make business decisions that put companies on top of their competitors. Data is increasing daily, and businesses want to use all their data to perform advanced business analytics and machine learning and distribute data to their backend algorithms to evaluate and make decisions faster. However, the carbon footprints and global warming have alarmed these organizations to move towards green computing for a better future. Green computing focuses on designing energy-efficient systems, optimizing resource utilization, and reducing the CO2 emissions of data centers and IT infrastructure. This paper reviews how data warehouse architecture, big data, and green computing relate and addresses the challenges and opportunities in achieving sustainable and scalable data management solutions. By integrating energy-efficient practices into data warehouses and big data systems, organizations can make a huge difference globally and set an example for other industries to follow the green computing path. This paper helps to understand the new paradigm of big data and green computing, which helps achieve the best performance, reduce environmental impacts, and achieve the best standards.",
    "link": "https://www.hal.science",
    "pdf": "https://hal.science/hal-04994743v1/document",
    "published": "2025-10-27"
  }
]
